#lang racket

(require rackunit)

; Упражнение 2.4.
; Вот еще одно процедурное представление для пар. Проверьте для этого представления, что при
; любых двух объектах x и y (car (cons x y)) возвращает x.
; (define (cons x y)
;   (lambda (m) (m x y)))
;
; (define (car z)
;   (z (lambda (p q) p)))
;
; Каково соответствующее определение cdr? (Подсказка: Чтобы проверить, что это работает, ис-
; пользуйте подстановочную модель из раздела 1.1.5.)
;-------------------------------------------------------------------
; Воспользуемся подстановочной моделью:
; (car (cons 1 2)) = (lambda ((lambda (p q) p))) ((lambda (1 2) 1)) x y)) = 1
; (cdr (cons 1 2)) = (lambda ((lambda (p q) q))) ((lambda (1 2) 2)) x y)) = 2
;-------------------------------------------------------------------

(define (cons x y)
  (lambda (m) (m x y)))

(define (car z)
  (z (lambda (p q) p)))

(define (cdr z)
  (z (lambda (p q) q)))

;-------------------------------------------------------------------

(check-equal? (car (cons 1 2)) 1)
(check-equal? (cdr (cons 1 2)) 2)

;===================================================================