#lang racket

; Упражнение 2.25.
; Укажите комбинации car и cdr, которые извлекают 7 из следующих списков:
; (1 3 (5 7) 9)
; ((7))
; (1 (2 (3 (4 (5 (6 7))))))
;-------------------------------------------------------------------

(define x '(1 3 (5 7) 9))

(define y '((7)))

(define z '(1 (2 (3 (4 (5 (6 7)))))))

(car (cdr (car (cdr (cdr x)))))

(car (car y))

(car (cdr (car (cdr (car (cdr (car (cdr (car (cdr (car (cdr z))))))))))))

;-------------------------------------------------------------------