#lang racket

(require rackunit)

; Упражнение 2.34.
; Заполните пропуски в следующей заготовке так, чтобы получить процедуру, которая вычисляет
; многочлены по схеме Горнера. Предполагается, что коэффициенты многочлена представлены в
; виде последовательности, от a0 до an.
; Например, чтобы вычислить 1 + 3x + 5x3 + x5 в точке x = 2, нужно ввести
; (horner-eval 2 (list 1 3 0 5 0 1))
;-------------------------------------------------------------------

(define (accumulate op initial sequence)
  (if (null? sequence)
      initial
      (op (car sequence)
          (accumulate op initial (cdr sequence)))))

;-------------------------------------------------------------------

(define (horner-eval x coefficient-sequence)
  (accumulate (lambda (this-coeff higher-terms) (+ this-coeff (* higher-terms x)))
              0
              coefficient-sequence))

;-------------------------------------------------------------------

;===================================================================

(check-equal? (horner-eval 2 (list 1 3 0 5 0 1)) 79)

;===================================================================