#lang racket

(require rackunit)

; Упражнение 2.17.
; Определите процедуру last-pair, которая возвращает список, содержащий только последний
; элемент данного (непустого) списка.
; (last-pair (list 23 72 149 34))
; (34)
;-------------------------------------------------------------------

; Идея проста, если хвост(cdr) это пустой список, значит это последний элемент и мы возвращаем список из головы(car) такого списка
; Иначе рекурсивно вызываем процедуру, передавая ей хвост(cdr) списка

(define (last-pair items)
  (if (null? (cdr items)) (list (car items))
      (last-pair (cdr items))))

;-------------------------------------------------------------------

;===================================================================

(check-equal? (last-pair (list 1 4 6 -6 0)) (list 0))
(check-equal? (last-pair (list 1 4 5)) (list 5))

;===================================================================