#lang racket

; Упражнение 1.10.
; Следующая процедура вычисляет математическую функцию, называемую функцией Аккермана.
; (define (A x y)
;   (cond ((= y 0) 0)
;         ((= x 0) (* 2 y))
;         ((= y 1) 2)
;         (else (A (- x 1)
;                  (A x (- y 1))))))

; Каковы значения следующих выражений?
; (A 1 10) 2^10
; (A 2 4)  2^2*4 = 2^16
; (A 3 3)
;-------------------------------------------------------------------
; Вычислим значение:
; (A 1 10)
;   (A 0 (A 1 9))
;          (A 0 (A 1 8))
;               (A 0 (A 1 7))
;                    (A 0 (A 1 6))
;                         (A 0 (A 1 5))
;                              (A 0 (A 1 4))
;                                   (A 0 (A 1 3))
;                                        (A 0 (A 1 2))
;                                             (A 0 (A 1 1))
;                                                  2
;                                             (A 0 2)
;                                             (* 2 2) = 4
;                                        (A 0 4)
;                                        (* 2 4) = 8
;                                   (A 0 8)
;                                   (* 2 8) = 16
;                              (A 0 16)
;                              (* 2 16) = 32
;       .......................
;   1024
;-------------------------------------------------------------------
; (A 2 4)
;   (A 1 (A 2 3))
;          (A 1 (A 2 2))
;                 (A 1 (A 2 1))
;                      2
;                 (A 1 2)                  
;                 4
;          (A 1 4) = 2^4 = 16
;   (A 1 16)   = 2^16 = 65536
;-------------------------------------------------------------------
; (A 3 3)
;   (A 2 (A 3 2))
;          (A 2 (A 3 1))
;               2
;          (A 2 2)
;            (A 1 (A 2 1))
;                 2
;            (A 1 2)
;        4
;   (A 2 4)
; 65536
;-------------------------------------------------------------------
; Проверим правильность в интерпретаторе
(define (A x y)
  (cond ((= y 0) 0)
        ((= x 0) (* 2 y))
        ((= y 1) 2)
        (else (A (- x 1)
                 (A x (- y 1))))))

(A 1 10) ; 1024
(A 2 4)  ; 65536
(A 3 3)  ; 65536
;-------------------------------------------------------------------
; Рассмотрим следующие процедуры, где A — процедура, определенная выше:
; (define (f n) (A 0 n))
; (define (g n) (A 1 n))
; (define (h n) (A 2 n))
; (define (k n) (* 5 n n))

; Дайте краткие математические определения функций, вычисляемых процедурами f, g и h для
; положительных целых значений n. Например, (k n) вычисляет 5n^2.
;-------------------------------------------------------------------
; (define (f n) (A 0 n)) -> f удвояет аргумент 2n
; (define (g n) (A 1 n)) -> g возвращает 2^n
; (define (h n) (A 2 n)) -> h возвращает ???
;===================================================================