#lang racket

; Упражнение 1.44.
; Идея сглаживания (smoothing a function) играет важную роль в обработке сигналов. Если f —
; функция, а dx — некоторое малое число, то сглаженная версия f есть функция, значение кото-
; рой в точке x есть среднее между f(x - dx), f(x) и f(x + dx). Напишите процедуру smooth,
; которая в качестве ввода принимает процедуру, вычисляющую f, и возвращает процедуру, вы-
; числяющую сглаженную версию f. Иногда бывает удобно проводить повторное сглаживание (то
; есть сглаживать сглаженную функцию и т.д.), получая n-кратно сглаженную функцию (n-fold
; smoothed function). Покажите, как породить n-кратно сглаженную функцию с помощью smooth и
; repeated из упражнения 1.43.
;------------------------------------------------------------------
(define (inc x) (+ x 1))

(define (repeated f n)
 (lambda (x)
   (define (iter result counter)
     (if (= counter n)
         result
         (iter (f result) (inc counter))))
   (iter (f x) 1)))
;------------------------------------------------------------------
(define dx 0.00001)

(define (average3 a b c) (/ (+ a b c) 3))

(define (smooth f)
  (lambda (x) (average3 (f (- x dx)) (f x) (f (+ x dx)))))
;------------------------------------------------------------------
(define (cube x) (* x x x))
;------------------------------------------------------------------
((smooth cube) 2)

((repeated (smooth cube) 2) 5.0)
;------------------------------------------------------------------
(define (repeated-smooth f n)
  (lambda (x) ((repeated f n) x)))
;------------------------------------------------------------------
((repeated-smooth cube 2) 5.0)
;==================================================================