#lang racket

; Упражнение 1.11.
; Функция f определяется правилом: f(n) = n, если n < 3, и f(n) = f(n-1)+f(n-2)+f(n-3),
; если n ≥ 3. Напишите процедуру, вычисляющую f с помощью рекурсивного процесса. Напишите
; процедуру, вычисляющую f с помощью итеративного процесса.
;-------------------------------------------------------------------
; Рекурсивный процесс
(define (f n)
  (if (< n 3)
      n
      (+ (f (- n 1)) (f (- n 2)) (f (- n 3)))))

(f 0)
(f 1)
(f 2)
(f 3)
(f 4)
(f 5)
(f 6)
(newline)
;-------------------------------------------------------------------
; Итеративный процесс
(define (f1 n)
  (define (f1-iter a b c counter)
    (if (< n 3)
        n        
        (if (> counter n)
            a
            (f1-iter (+ a b c) a b (+ counter 1)))))
  (f1-iter 2 1 0 3))

(= (f 0) (f1 0))
(= (f 1) (f1 1))
(= (f 2) (f1 2))
(= (f 3) (f1 3))
(= (f 4) (f1 4))
(= (f 5) (f1 5))
(= (f 6) (f1 6))
(= (f 7) (f1 7))
;===================================================================